Solver/openfoam7/tutorials/rigidCircularCylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-15       0      0)
    (-0.5      0      0)
    ( 2.3456  14.8513 0)
    ( 0.0782   0.4938 0)
    ( 0.0782  -0.4938 0)
    ( 2.3456 -14.8513 0)
 
    (-15       0      1.0000)
    (-0.5      0      1.0000)
    ( 2.3456  14.8513 1.0000)
    ( 0.0782   0.4938 1.0000)
    ( 0.0782  -0.4938 1.0000)
    ( 2.3456 -14.8513 1.0000)
);

blocks
(
    hex (1 4 10 7 0 5 11 6) (33 1 120) simpleGrading (1 1 25)
    hex (3 1 7 9 2 0 6 8) (33 1 120) simpleGrading (1 1 25)
    hex (4 3 9 10 5 2 8 11) (54 1 120) simpleGrading (1 1 25)
);

edges
(
    arc  0  5 (-10.6066 -10.6066 0)
    arc  6 11 (-10.6066 -10.6066 1.0000)
    arc  1  4 ( -0.3536  -0.3536 0)
    arc  7 10 ( -0.3536  -0.3536 1.0000)

    arc  2  0 (-10.6066  10.6066 0)
    arc  8  6 (-10.6066  10.6066 1.0000)
    arc  3  1 ( -0.3536   0.3536 0)
    arc  9  7 ( -0.3536   0.3536 1.0000)

    arc  5  2 ( 15        0      0)
    arc 11  8 ( 15        0      1.0000)
    arc  4  3 (  0.5      0      0)
    arc 10  9 (  0.5      0      1.0000)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 0 6 8)
            (0 5 11 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 2 8 11)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (1 4 10 7)
            (4 3 9 10)
            (3 1 7 9)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 4 1)
            (4 5 2 3)
            (3 2 0 1)
            (6 11 10 7)
            (10 11 8 9)
            (9 8 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
