Solver/openfoam7/tutorials/rigidCircularCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          66;
        startFace       28680;
    }
    outlet
    {
        type            patch;
        nFaces          54;
        startFace       28746;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       28800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          28800;
        startFace       28920;
    }
)

// ************************************************************************* //
